sammtcbn/rl78g12-notes/07_led_toggle/iodefine.h
#define TMIF03       (((volatile __near __bitf_T *)0xFFE2)->no1)
#define ADIF         (((volatile __near __bitf_T *)0xFFE2)->no2)
#define TMKAIF       (((volatile __near __bitf_T *)0xFFE2)->no3)
#define KRIF         (((volatile __near __bitf_T *)0xFFE2)->no4)
#define MDIF         (((volatile __near __bitf_T *)0xFFE2)->no5)
#define FLIF         (((volatile __near __bitf_T *)0xFFE2)->no6)
#define MK0          (*(volatile __near unsigned short *)0xFFE4)
#define MK0L         (*(volatile __near unsigned char  *)0xFFE4)
#define MK0L_bit     (*(volatile __near __bitf_T *)0xFFE4)
#define MK0H         (*(volatile __near unsigned char  *)0xFFE5)
#define MK0H_bit     (*(volatile __near __bitf_T *)0xFFE5)
#define WDTIMK       (((volatile __near __bitf_T *)0xFFE4)->no0)
#define LVIMK        (((volatile __near __bitf_T *)0xFFE4)->no1)
#define PMK0         (((volatile __near __bitf_T *)0xFFE4)->no2)
#define PMK1         (((volatile __near __bitf_T *)0xFFE4)->no3)
#define PMK2         (((volatile __near __bitf_T *)0xFFE4)->no4)
#define PMK3         (((volatile __near __bitf_T *)0xFFE4)->no5)
#define DMAMK0       (((volatile __near __bitf_T *)0xFFE4)->no6)
#define DMAMK1       (((volatile __near __bitf_T *)0xFFE4)->no7)
#define CSIMK00      (((volatile __near __bitf_T *)0xFFE5)->no0)
#define IICMK00      (((volatile __near __bitf_T *)0xFFE5)->no0)
#define STMK0        (((volatile __near __bitf_T *)0xFFE5)->no0)
#define CSIMK01      (((volatile __near __bitf_T *)0xFFE5)->no1)
#define IICMK01      (((volatile __near __bitf_T *)0xFFE5)->no1)
#define SRMK0        (((volatile __near __bitf_T *)0xFFE5)->no1)
#define SREMK0       (((volatile __near __bitf_T *)0xFFE5)->no2)
#define TMMK01H      (((volatile __near __bitf_T *)0xFFE5)->no3)
#define TMMK03H      (((volatile __near __bitf_T *)0xFFE5)->no4)
#define IICAMK0      (((volatile __near __bitf_T *)0xFFE5)->no5)
#define TMMK00       (((volatile __near __bitf_T *)0xFFE5)->no6)
#define TMMK01       (((volatile __near __bitf_T *)0xFFE5)->no7)
#define MK1          (*(volatile __near unsigned short *)0xFFE6)
#define MK1L         (*(volatile __near unsigned char  *)0xFFE6)
#define MK1L_bit     (*(volatile __near __bitf_T *)0xFFE6)
#define TMMK02       (((volatile __near __bitf_T *)0xFFE6)->no0)
#define TMMK03       (((volatile __near __bitf_T *)0xFFE6)->no1)
#define ADMK         (((volatile __near __bitf_T *)0xFFE6)->no2)
#define TMKAMK       (((volatile __near __bitf_T *)0xFFE6)->no3)
#define KRMK         (((volatile __near __bitf_T *)0xFFE6)->no4)
#define MDMK         (((volatile __near __bitf_T *)0xFFE6)->no5)
#define FLMK         (((volatile __near __bitf_T *)0xFFE6)->no6)
#define PR00         (*(volatile __near unsigned short *)0xFFE8)
#define PR00L        (*(volatile __near unsigned char  *)0xFFE8)
#define PR00L_bit    (*(volatile __near __bitf_T *)0xFFE8)
#define PR00H        (*(volatile __near unsigned char  *)0xFFE9)
#define PR00H_bit    (*(volatile __near __bitf_T *)0xFFE9)
#define WDTIPR0      (((volatile __near __bitf_T *)0xFFE8)->no0)
#define LVIPR0       (((volatile __near __bitf_T *)0xFFE8)->no1)
#define PPR00        (((volatile __near __bitf_T *)0xFFE8)->no2)
#define PPR01        (((volatile __near __bitf_T *)0xFFE8)->no3)
#define PPR02        (((volatile __near __bitf_T *)0xFFE8)->no4)
#define PPR03        (((volatile __near __bitf_T *)0xFFE8)->no5)
#define DMAPR00      (((volatile __near __bitf_T *)0xFFE8)->no6)
#define DMAPR01      (((volatile __near __bitf_T *)0xFFE8)->no7)
#define CSIPR000     (((volatile __near __bitf_T *)0xFFE9)->no0)
#define IICPR000     (((volatile __near __bitf_T *)0xFFE9)->no0)
#define STPR00       (((volatile __near __bitf_T *)0xFFE9)->no0)
#define CSIPR001     (((volatile __near __bitf_T *)0xFFE9)->no1)
#define IICPR001     (((volatile __near __bitf_T *)0xFFE9)->no1)
#define SRPR00       (((volatile __near __bitf_T *)0xFFE9)->no1)
#define SREPR00      (((volatile __near __bitf_T *)0xFFE9)->no2)
#define TMPR001H     (((volatile __near __bitf_T *)0xFFE9)->no3)
#define TMPR003H     (((volatile __near __bitf_T *)0xFFE9)->no4)
#define IICAPR00     (((volatile __near __bitf_T *)0xFFE9)->no5)
#define TMPR000      (((volatile __near __bitf_T *)0xFFE9)->no6)
#define TMPR001      (((volatile __near __bitf_T *)0xFFE9)->no7)
#define PR01         (*(volatile __near unsigned short *)0xFFEA)
#define PR01L        (*(volatile __near unsigned char  *)0xFFEA)
#define PR01L_bit    (*(volatile __near __bitf_T *)0xFFEA)
#define TMPR002      (((volatile __near __bitf_T *)0xFFEA)->no0)
#define TMPR003      (((volatile __near __bitf_T *)0xFFEA)->no1)
#define ADPR0        (((volatile __near __bitf_T *)0xFFEA)->no2)
#define TMKAPR0      (((volatile __near __bitf_T *)0xFFEA)->no3)
#define KRPR0        (((volatile __near __bitf_T *)0xFFEA)->no4)
#define MDPR0        (((volatile __near __bitf_T *)0xFFEA)->no5)
#define FLPR0        (((volatile __near __bitf_T *)0xFFEA)->no6)
#define PR10         (*(volatile __near unsigned short *)0xFFEC)
#define PR10L        (*(volatile __near unsigned char  *)0xFFEC)
#define PR10L_bit    (*(volatile __near __bitf_T *)0xFFEC)
#define PR10H        (*(volatile __near unsigned char  *)0xFFED)
#define PR10H_bit    (*(volatile __near __bitf_T *)0xFFED)
#define WDTIPR1      (((volatile __near __bitf_T *)0xFFEC)->no0)
#define LVIPR1       (((volatile __near __bitf_T *)0xFFEC)->no1)
#define PPR10        (((volatile __near __bitf_T *)0xFFEC)->no2)
#define PPR11        (((volatile __near __bitf_T *)0xFFEC)->no3)
#define PPR12        (((volatile __near __bitf_T *)0xFFEC)->no4)
#define PPR13        (((volatile __near __bitf_T *)0xFFEC)->no5)
#define DMAPR10      (((volatile __near __bitf_T *)0xFFEC)->no6)
#define DMAPR11      (((volatile __near __bitf_T *)0xFFEC)->no7)
#define CSIPR100     (((volatile __near __bitf_T *)0xFFED)->no0)
#define IICPR100     (((volatile __near __bitf_T *)0xFFED)->no0)
#define STPR10       (((volatile __near __bitf_T *)0xFFED)->no0)
#define CSIPR101     (((volatile __near __bitf_T *)0xFFED)->no1)
#define IICPR101     (((volatile __near __bitf_T *)0xFFED)->no1)
#define SRPR10       (((volatile __near __bitf_T *)0xFFED)->no1)
#define SREPR10      (((volatile __near __bitf_T *)0xFFED)->no2)
#define TMPR101H     (((volatile __near __bitf_T *)0xFFED)->no3)
#define TMPR103H     (((volatile __near __bitf_T *)0xFFED)->no4)
#define IICAPR10     (((volatile __near __bitf_T *)0xFFED)->no5)
#define TMPR100      (((volatile __near __bitf_T *)0xFFED)->no6)
#define TMPR101      (((volatile __near __bitf_T *)0xFFED)->no7)
#define PR11         (*(volatile __near unsigned short *)0xFFEE)
#define PR11L        (*(volatile __near unsigned char  *)0xFFEE)
#define PR11L_bit    (*(volatile __near __bitf_T *)0xFFEE)
#define TMPR102      (((volatile __near __bitf_T *)0xFFEE)->no0)
#define TMPR103      (((volatile __near __bitf_T *)0xFFEE)->no1)
#define ADPR1        (((volatile __near __bitf_T *)0xFFEE)->no2)
#define TMKAPR1      (((volatile __near __bitf_T *)0xFFEE)->no3)
#define KRPR1        (((volatile __near __bitf_T *)0xFFEE)->no4)
#define MDPR1        (((volatile __near __bitf_T *)0xFFEE)->no5)
#define FLPR1        (((volatile __near __bitf_T *)0xFFEE)->no6)
#define MDAL         (*(volatile __near unsigned short *)0xFFF0)
#define MULA         (*(volatile __near unsigned short *)0xFFF0)
#define MDAH         (*(volatile __near unsigned short *)0xFFF2)
#define MULB         (*(volatile __near unsigned short *)0xFFF2)
#define MDBH         (*(volatile __near unsigned short *)0xFFF4)
#define MULOH        (*(volatile __near unsigned short *)0xFFF4)
#define MDBL         (*(volatile __near unsigned short *)0xFFF6)
#define MULOL        (*(volatile __near unsigned short *)0xFFF6)
#define PMC          (*(volatile __near unsigned char  *)0xFFFE)
#define PMC_bit      (*(volatile __near __bitf_T *)0xFFFE)
#define MAA          (((volatile __near __bitf_T *)0xFFFE)->no0)


#define INTWDTI                         0x0004
#define INTLVI                          0x0006
#define INTP0                           0x0008
#define INTP1                           0x000A
#define INTP2                           0x000C
#define INTP3                           0x000E
#define INTDMA0                         0x0010
#define INTDMA1                         0x0012
#define INTCSI00                        0x0014
#define INTIIC00                        0x0014
#define INTST0                          0x0014
#define INTCSI01                        0x0016
#define INTIIC01                        0x0016
#define INTSR0                          0x0016
#define INTSRE0                         0x0018
#define INTTM01H                        0x001A
#define INTTM03H                        0x001C
#define INTIICA0                        0x001E
#define INTTM00                         0x0020
#define INTTM01                         0x0022
#define INTTM02                         0x0024
#define INTTM03                         0x0026
#define INTAD                           0x0028
#define INTIT                           0x002A
#define INTKR                           0x002C
#define INTMD                           0x002E
#define INTFL                           0x0030

#endif
